; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l5-t1-p15---int100n150-m25---int100c110---s446---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 - fuellevel
)

(:init
(sum level0 level5 level5)
(sum level0 level7 level7)
(sum level0 level9 level9)
(sum level0 level16 level16)
(sum level0 level17 level17)
(sum level0 level23 level23)
(sum level0 level24 level24)
(sum level1 level5 level6)
(sum level1 level7 level8)
(sum level1 level9 level10)
(sum level1 level16 level17)
(sum level1 level17 level18)
(sum level1 level23 level24)
(sum level1 level24 level25)
(sum level2 level5 level7)
(sum level2 level7 level9)
(sum level2 level9 level11)
(sum level2 level16 level18)
(sum level2 level17 level19)
(sum level2 level23 level25)
(sum level2 level24 level26)
(sum level3 level5 level8)
(sum level3 level7 level10)
(sum level3 level9 level12)
(sum level3 level16 level19)
(sum level3 level17 level20)
(sum level3 level23 level26)
(sum level3 level24 level27)
(sum level4 level5 level9)
(sum level4 level7 level11)
(sum level4 level9 level13)
(sum level4 level16 level20)
(sum level4 level17 level21)
(sum level4 level23 level27)
(sum level4 level24 level28)
(sum level5 level5 level10)
(sum level5 level7 level12)
(sum level5 level9 level14)
(sum level5 level16 level21)
(sum level5 level17 level22)
(sum level5 level23 level28)
(sum level5 level24 level29)
(sum level6 level5 level11)
(sum level6 level7 level13)
(sum level6 level9 level15)
(sum level6 level16 level22)
(sum level6 level17 level23)
(sum level6 level23 level29)
(sum level6 level24 level30)
(sum level7 level5 level12)
(sum level7 level7 level14)
(sum level7 level9 level16)
(sum level7 level16 level23)
(sum level7 level17 level24)
(sum level7 level23 level30)
(sum level7 level24 level31)
(sum level8 level5 level13)
(sum level8 level7 level15)
(sum level8 level9 level17)
(sum level8 level16 level24)
(sum level8 level17 level25)
(sum level8 level23 level31)
(sum level8 level24 level32)
(sum level9 level5 level14)
(sum level9 level7 level16)
(sum level9 level9 level18)
(sum level9 level16 level25)
(sum level9 level17 level26)
(sum level9 level23 level32)
(sum level9 level24 level33)
(sum level10 level5 level15)
(sum level10 level7 level17)
(sum level10 level9 level19)
(sum level10 level16 level26)
(sum level10 level17 level27)
(sum level10 level23 level33)
(sum level10 level24 level34)
(sum level11 level5 level16)
(sum level11 level7 level18)
(sum level11 level9 level20)
(sum level11 level16 level27)
(sum level11 level17 level28)
(sum level11 level23 level34)
(sum level11 level24 level35)
(sum level12 level5 level17)
(sum level12 level7 level19)
(sum level12 level9 level21)
(sum level12 level16 level28)
(sum level12 level17 level29)
(sum level12 level23 level35)
(sum level12 level24 level36)
(sum level13 level5 level18)
(sum level13 level7 level20)
(sum level13 level9 level22)
(sum level13 level16 level29)
(sum level13 level17 level30)
(sum level13 level23 level36)
(sum level13 level24 level37)
(sum level14 level5 level19)
(sum level14 level7 level21)
(sum level14 level9 level23)
(sum level14 level16 level30)
(sum level14 level17 level31)
(sum level14 level23 level37)
(sum level14 level24 level38)
(sum level15 level5 level20)
(sum level15 level7 level22)
(sum level15 level9 level24)
(sum level15 level16 level31)
(sum level15 level17 level32)
(sum level15 level23 level38)
(sum level15 level24 level39)
(sum level16 level5 level21)
(sum level16 level7 level23)
(sum level16 level9 level25)
(sum level16 level16 level32)
(sum level16 level17 level33)
(sum level16 level23 level39)
(sum level16 level24 level40)
(sum level17 level5 level22)
(sum level17 level7 level24)
(sum level17 level9 level26)
(sum level17 level16 level33)
(sum level17 level17 level34)
(sum level17 level23 level40)
(sum level17 level24 level41)
(sum level18 level5 level23)
(sum level18 level7 level25)
(sum level18 level9 level27)
(sum level18 level16 level34)
(sum level18 level17 level35)
(sum level18 level23 level41)
(sum level18 level24 level42)
(sum level19 level5 level24)
(sum level19 level7 level26)
(sum level19 level9 level28)
(sum level19 level16 level35)
(sum level19 level17 level36)
(sum level19 level23 level42)
(sum level19 level24 level43)
(sum level20 level5 level25)
(sum level20 level7 level27)
(sum level20 level9 level29)
(sum level20 level16 level36)
(sum level20 level17 level37)
(sum level20 level23 level43)
(sum level20 level24 level44)
(sum level21 level5 level26)
(sum level21 level7 level28)
(sum level21 level9 level30)
(sum level21 level16 level37)
(sum level21 level17 level38)
(sum level21 level23 level44)
(sum level21 level24 level45)
(sum level22 level5 level27)
(sum level22 level7 level29)
(sum level22 level9 level31)
(sum level22 level16 level38)
(sum level22 level17 level39)
(sum level22 level23 level45)
(sum level22 level24 level46)
(sum level23 level5 level28)
(sum level23 level7 level30)
(sum level23 level9 level32)
(sum level23 level16 level39)
(sum level23 level17 level40)
(sum level23 level23 level46)
(sum level23 level24 level47)
(sum level24 level5 level29)
(sum level24 level7 level31)
(sum level24 level9 level33)
(sum level24 level16 level40)
(sum level24 level17 level41)
(sum level24 level23 level47)
(sum level24 level24 level48)
(sum level25 level5 level30)
(sum level25 level7 level32)
(sum level25 level9 level34)
(sum level25 level16 level41)
(sum level25 level17 level42)
(sum level25 level23 level48)
(sum level25 level24 level49)
(sum level26 level5 level31)
(sum level26 level7 level33)
(sum level26 level9 level35)
(sum level26 level16 level42)
(sum level26 level17 level43)
(sum level26 level23 level49)
(sum level26 level24 level50)
(sum level27 level5 level32)
(sum level27 level7 level34)
(sum level27 level9 level36)
(sum level27 level16 level43)
(sum level27 level17 level44)
(sum level27 level23 level50)
(sum level27 level24 level51)
(sum level28 level5 level33)
(sum level28 level7 level35)
(sum level28 level9 level37)
(sum level28 level16 level44)
(sum level28 level17 level45)
(sum level28 level23 level51)
(sum level28 level24 level52)
(sum level29 level5 level34)
(sum level29 level7 level36)
(sum level29 level9 level38)
(sum level29 level16 level45)
(sum level29 level17 level46)
(sum level29 level23 level52)
(sum level29 level24 level53)
(sum level30 level5 level35)
(sum level30 level7 level37)
(sum level30 level9 level39)
(sum level30 level16 level46)
(sum level30 level17 level47)
(sum level30 level23 level53)
(sum level30 level24 level54)
(sum level31 level5 level36)
(sum level31 level7 level38)
(sum level31 level9 level40)
(sum level31 level16 level47)
(sum level31 level17 level48)
(sum level31 level23 level54)
(sum level31 level24 level55)
(sum level32 level5 level37)
(sum level32 level7 level39)
(sum level32 level9 level41)
(sum level32 level16 level48)
(sum level32 level17 level49)
(sum level32 level23 level55)
(sum level32 level24 level56)
(sum level33 level5 level38)
(sum level33 level7 level40)
(sum level33 level9 level42)
(sum level33 level16 level49)
(sum level33 level17 level50)
(sum level33 level23 level56)
(sum level33 level24 level57)
(sum level34 level5 level39)
(sum level34 level7 level41)
(sum level34 level9 level43)
(sum level34 level16 level50)
(sum level34 level17 level51)
(sum level34 level23 level57)
(sum level34 level24 level58)
(sum level35 level5 level40)
(sum level35 level7 level42)
(sum level35 level9 level44)
(sum level35 level16 level51)
(sum level35 level17 level52)
(sum level35 level23 level58)
(sum level35 level24 level59)
(sum level36 level5 level41)
(sum level36 level7 level43)
(sum level36 level9 level45)
(sum level36 level16 level52)
(sum level36 level17 level53)
(sum level36 level23 level59)
(sum level36 level24 level60)
(sum level37 level5 level42)
(sum level37 level7 level44)
(sum level37 level9 level46)
(sum level37 level16 level53)
(sum level37 level17 level54)
(sum level37 level23 level60)
(sum level37 level24 level61)
(sum level38 level5 level43)
(sum level38 level7 level45)
(sum level38 level9 level47)
(sum level38 level16 level54)
(sum level38 level17 level55)
(sum level38 level23 level61)
(sum level38 level24 level62)
(sum level39 level5 level44)
(sum level39 level7 level46)
(sum level39 level9 level48)
(sum level39 level16 level55)
(sum level39 level17 level56)
(sum level39 level23 level62)
(sum level39 level24 level63)
(sum level40 level5 level45)
(sum level40 level7 level47)
(sum level40 level9 level49)
(sum level40 level16 level56)
(sum level40 level17 level57)
(sum level40 level23 level63)
(sum level40 level24 level64)
(sum level41 level5 level46)
(sum level41 level7 level48)
(sum level41 level9 level50)
(sum level41 level16 level57)
(sum level41 level17 level58)
(sum level41 level23 level64)
(sum level41 level24 level65)
(sum level42 level5 level47)
(sum level42 level7 level49)
(sum level42 level9 level51)
(sum level42 level16 level58)
(sum level42 level17 level59)
(sum level42 level23 level65)
(sum level42 level24 level66)
(sum level43 level5 level48)
(sum level43 level7 level50)
(sum level43 level9 level52)
(sum level43 level16 level59)
(sum level43 level17 level60)
(sum level43 level23 level66)
(sum level43 level24 level67)
(sum level44 level5 level49)
(sum level44 level7 level51)
(sum level44 level9 level53)
(sum level44 level16 level60)
(sum level44 level17 level61)
(sum level44 level23 level67)
(sum level44 level24 level68)
(sum level45 level5 level50)
(sum level45 level7 level52)
(sum level45 level9 level54)
(sum level45 level16 level61)
(sum level45 level17 level62)
(sum level45 level23 level68)
(sum level45 level24 level69)
(sum level46 level5 level51)
(sum level46 level7 level53)
(sum level46 level9 level55)
(sum level46 level16 level62)
(sum level46 level17 level63)
(sum level46 level23 level69)
(sum level46 level24 level70)
(sum level47 level5 level52)
(sum level47 level7 level54)
(sum level47 level9 level56)
(sum level47 level16 level63)
(sum level47 level17 level64)
(sum level47 level23 level70)
(sum level47 level24 level71)
(sum level48 level5 level53)
(sum level48 level7 level55)
(sum level48 level9 level57)
(sum level48 level16 level64)
(sum level48 level17 level65)
(sum level48 level23 level71)
(sum level48 level24 level72)
(sum level49 level5 level54)
(sum level49 level7 level56)
(sum level49 level9 level58)
(sum level49 level16 level65)
(sum level49 level17 level66)
(sum level49 level23 level72)
(sum level49 level24 level73)
(sum level50 level5 level55)
(sum level50 level7 level57)
(sum level50 level9 level59)
(sum level50 level16 level66)
(sum level50 level17 level67)
(sum level50 level23 level73)
(sum level50 level24 level74)
(sum level51 level5 level56)
(sum level51 level7 level58)
(sum level51 level9 level60)
(sum level51 level16 level67)
(sum level51 level17 level68)
(sum level51 level23 level74)
(sum level51 level24 level75)
(sum level52 level5 level57)
(sum level52 level7 level59)
(sum level52 level9 level61)
(sum level52 level16 level68)
(sum level52 level17 level69)
(sum level52 level23 level75)
(sum level52 level24 level76)
(sum level53 level5 level58)
(sum level53 level7 level60)
(sum level53 level9 level62)
(sum level53 level16 level69)
(sum level53 level17 level70)
(sum level53 level23 level76)
(sum level53 level24 level77)
(sum level54 level5 level59)
(sum level54 level7 level61)
(sum level54 level9 level63)
(sum level54 level16 level70)
(sum level54 level17 level71)
(sum level54 level23 level77)
(sum level54 level24 level78)
(sum level55 level5 level60)
(sum level55 level7 level62)
(sum level55 level9 level64)
(sum level55 level16 level71)
(sum level55 level17 level72)
(sum level55 level23 level78)
(sum level55 level24 level79)
(sum level56 level5 level61)
(sum level56 level7 level63)
(sum level56 level9 level65)
(sum level56 level16 level72)
(sum level56 level17 level73)
(sum level56 level23 level79)
(sum level56 level24 level80)
(sum level57 level5 level62)
(sum level57 level7 level64)
(sum level57 level9 level66)
(sum level57 level16 level73)
(sum level57 level17 level74)
(sum level57 level23 level80)
(sum level57 level24 level81)
(sum level58 level5 level63)
(sum level58 level7 level65)
(sum level58 level9 level67)
(sum level58 level16 level74)
(sum level58 level17 level75)
(sum level58 level23 level81)
(sum level58 level24 level82)
(sum level59 level5 level64)
(sum level59 level7 level66)
(sum level59 level9 level68)
(sum level59 level16 level75)
(sum level59 level17 level76)
(sum level59 level23 level82)
(sum level59 level24 level83)
(sum level60 level5 level65)
(sum level60 level7 level67)
(sum level60 level9 level69)
(sum level60 level16 level76)
(sum level60 level17 level77)
(sum level60 level23 level83)
(sum level60 level24 level84)
(sum level61 level5 level66)
(sum level61 level7 level68)
(sum level61 level9 level70)
(sum level61 level16 level77)
(sum level61 level17 level78)
(sum level61 level23 level84)
(sum level61 level24 level85)
(sum level62 level5 level67)
(sum level62 level7 level69)
(sum level62 level9 level71)
(sum level62 level16 level78)
(sum level62 level17 level79)
(sum level62 level23 level85)
(sum level62 level24 level86)
(sum level63 level5 level68)
(sum level63 level7 level70)
(sum level63 level9 level72)
(sum level63 level16 level79)
(sum level63 level17 level80)
(sum level63 level23 level86)
(sum level63 level24 level87)
(sum level64 level5 level69)
(sum level64 level7 level71)
(sum level64 level9 level73)
(sum level64 level16 level80)
(sum level64 level17 level81)
(sum level64 level23 level87)
(sum level64 level24 level88)
(sum level65 level5 level70)
(sum level65 level7 level72)
(sum level65 level9 level74)
(sum level65 level16 level81)
(sum level65 level17 level82)
(sum level65 level23 level88)
(sum level65 level24 level89)
(sum level66 level5 level71)
(sum level66 level7 level73)
(sum level66 level9 level75)
(sum level66 level16 level82)
(sum level66 level17 level83)
(sum level66 level23 level89)
(sum level67 level5 level72)
(sum level67 level7 level74)
(sum level67 level9 level76)
(sum level67 level16 level83)
(sum level67 level17 level84)
(sum level68 level5 level73)
(sum level68 level7 level75)
(sum level68 level9 level77)
(sum level68 level16 level84)
(sum level68 level17 level85)
(sum level69 level5 level74)
(sum level69 level7 level76)
(sum level69 level9 level78)
(sum level69 level16 level85)
(sum level69 level17 level86)
(sum level70 level5 level75)
(sum level70 level7 level77)
(sum level70 level9 level79)
(sum level70 level16 level86)
(sum level70 level17 level87)
(sum level71 level5 level76)
(sum level71 level7 level78)
(sum level71 level9 level80)
(sum level71 level16 level87)
(sum level71 level17 level88)
(sum level72 level5 level77)
(sum level72 level7 level79)
(sum level72 level9 level81)
(sum level72 level16 level88)
(sum level72 level17 level89)
(sum level73 level5 level78)
(sum level73 level7 level80)
(sum level73 level9 level82)
(sum level73 level16 level89)
(sum level74 level5 level79)
(sum level74 level7 level81)
(sum level74 level9 level83)
(sum level75 level5 level80)
(sum level75 level7 level82)
(sum level75 level9 level84)
(sum level76 level5 level81)
(sum level76 level7 level83)
(sum level76 level9 level85)
(sum level77 level5 level82)
(sum level77 level7 level84)
(sum level77 level9 level86)
(sum level78 level5 level83)
(sum level78 level7 level85)
(sum level78 level9 level87)
(sum level79 level5 level84)
(sum level79 level7 level86)
(sum level79 level9 level88)
(sum level80 level5 level85)
(sum level80 level7 level87)
(sum level80 level9 level89)
(sum level81 level5 level86)
(sum level81 level7 level88)
(sum level82 level5 level87)
(sum level82 level7 level89)
(sum level83 level5 level88)
(sum level84 level5 level89)

(connected l0 l1)
(fuelcost level5 l0 l1)
(connected l0 l3)
(fuelcost level24 l0 l3)
(connected l0 l4)
(fuelcost level9 l0 l4)
(connected l1 l0)
(fuelcost level5 l1 l0)
(connected l1 l2)
(fuelcost level23 l1 l2)
(connected l1 l3)
(fuelcost level16 l1 l3)
(connected l1 l4)
(fuelcost level17 l1 l4)
(connected l2 l1)
(fuelcost level23 l2 l1)
(connected l2 l3)
(fuelcost level7 l2 l3)
(connected l3 l0)
(fuelcost level24 l3 l0)
(connected l3 l1)
(fuelcost level16 l3 l1)
(connected l3 l2)
(fuelcost level7 l3 l2)
(connected l4 l0)
(fuelcost level9 l4 l0)
(connected l4 l1)
(fuelcost level17 l4 l1)

(at t0 l3)
(fuel t0 level89)
(= (total-cost) 0)

(at p0 l2)
(at p1 l2)
(at p2 l4)
(at p3 l4)
(at p4 l2)
(at p5 l2)
(at p6 l2)
(at p7 l2)
(at p8 l1)
(at p9 l3)
(at p10 l1)
(at p11 l1)
(at p12 l1)
(at p13 l0)
(at p14 l3)
)

(:goal
(and
(at p0 l1)
(at p1 l0)
(at p2 l0)
(at p3 l2)
(at p4 l3)
(at p5 l4)
(at p6 l1)
(at p7 l3)
(at p8 l4)
(at p9 l0)
(at p10 l4)
(at p11 l3)
(at p12 l3)
(at p13 l4)
(at p14 l4)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p9 t0 l3)
   deleted: (at p9 l3)
   added: (in p9 t0)
   goals met: 0 of 15
2. (load p14 t0 l3)
   deleted: (at p14 l3)
   added: (in p14 t0)
   goals met: 0 of 15
3. (drive t0 l3 l2 level82 level7 level89)
   deleted: (at t0 l3) (fuel t0 level89)
   added: (at t0 l2) (fuel t0 level82)
   goals met: 0 of 15
4. (load p7 t0 l2)
   deleted: (at p7 l2)
   added: (in p7 t0)
   goals met: 0 of 15
5. (load p6 t0 l2)
   deleted: (at p6 l2)
   added: (in p6 t0)
   goals met: 0 of 15
6. (load p5 t0 l2)
   deleted: (at p5 l2)
   added: (in p5 t0)
   goals met: 0 of 15
7. (load p4 t0 l2)
   deleted: (at p4 l2)
   added: (in p4 t0)
   goals met: 0 of 15
8. (load p1 t0 l2)
   deleted: (at p1 l2)
   added: (in p1 t0)
   goals met: 0 of 15
9. (load p0 t0 l2)
   deleted: (at p0 l2)
   added: (in p0 t0)
   goals met: 0 of 15
10. (drive t0 l2 l1 level59 level23 level82)
   deleted: (at t0 l2) (fuel t0 level82)
   added: (at t0 l1) (fuel t0 level59)
   goals met: 0 of 15
11. (unload p6 t0 l1)
   deleted: (in p6 t0)
   added: (at p6 l1)
   goals met: 1 of 15
12. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 2 of 15
13. (load p8 t0 l1)
   deleted: (at p8 l1)
   added: (in p8 t0)
   goals met: 2 of 15
14. (load p12 t0 l1)
   deleted: (at p12 l1)
   added: (in p12 t0)
   goals met: 2 of 15
15. (load p11 t0 l1)
   deleted: (at p11 l1)
   added: (in p11 t0)
   goals met: 2 of 15
16. (load p10 t0 l1)
   deleted: (at p10 l1)
   added: (in p10 t0)
   goals met: 2 of 15
17. (drive t0 l1 l0 level54 level5 level59)
   deleted: (at t0 l1) (fuel t0 level59)
   added: (at t0 l0) (fuel t0 level54)
   goals met: 2 of 15
18. (unload p9 t0 l0)
   deleted: (in p9 t0)
   added: (at p9 l0)
   goals met: 3 of 15
19. (unload p1 t0 l0)
   deleted: (in p1 t0)
   added: (at p1 l0)
   goals met: 4 of 15
20. (load p13 t0 l0)
   deleted: (at p13 l0)
   added: (in p13 t0)
   goals met: 4 of 15
21. (drive t0 l0 l4 level45 level9 level54)
   deleted: (at t0 l0) (fuel t0 level54)
   added: (at t0 l4) (fuel t0 level45)
   goals met: 4 of 15
22. (load p2 t0 l4)
   deleted: (at p2 l4)
   added: (in p2 t0)
   goals met: 4 of 15
23. (load p3 t0 l4)
   deleted: (at p3 l4)
   added: (in p3 t0)
   goals met: 4 of 15
24. (unload p10 t0 l4)
   deleted: (in p10 t0)
   added: (at p10 l4)
   goals met: 5 of 15
25. (unload p13 t0 l4)
   deleted: (in p13 t0)
   added: (at p13 l4)
   goals met: 6 of 15
26. (unload p14 t0 l4)
   deleted: (in p14 t0)
   added: (at p14 l4)
   goals met: 7 of 15
27. (unload p5 t0 l4)
   deleted: (in p5 t0)
   added: (at p5 l4)
   goals met: 8 of 15
28. (unload p8 t0 l4)
   deleted: (in p8 t0)
   added: (at p8 l4)
   goals met: 9 of 15
29. (drive t0 l4 l0 level36 level9 level45)
   deleted: (at t0 l4) (fuel t0 level45)
   added: (at t0 l0) (fuel t0 level36)
   goals met: 9 of 15
30. (unload p2 t0 l0)
   deleted: (in p2 t0)
   added: (at p2 l0)
   goals met: 10 of 15
31. (drive t0 l0 l3 level12 level24 level36)
   deleted: (at t0 l0) (fuel t0 level36)
   added: (at t0 l3) (fuel t0 level12)
   goals met: 10 of 15
32. (unload p11 t0 l3)
   deleted: (in p11 t0)
   added: (at p11 l3)
   goals met: 11 of 15
33. (unload p12 t0 l3)
   deleted: (in p12 t0)
   added: (at p12 l3)
   goals met: 12 of 15
34. (unload p4 t0 l3)
   deleted: (in p4 t0)
   added: (at p4 l3)
   goals met: 13 of 15
35. (unload p7 t0 l3)
   deleted: (in p7 t0)
   added: (at p7 l3)
   goals met: 14 of 15
36. (drive t0 l3 l2 level5 level7 level12)
   deleted: (at t0 l3) (fuel t0 level12)
   added: (at t0 l2) (fuel t0 level5)
   goals met: 14 of 15
37. (unload p3 t0 l2)
   deleted: (in p3 t0)
   added: (at p3 l2)
   goals met: 15 of 15
